Config/Documents/ПлатежноеТребование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлатежноеТребование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент - плательщик </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>Счет контрагента - плательщика</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа (электронно, почтой, телеграфом)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБанковскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБИКБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКорСчетБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательБанковскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательНаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательБИКБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательКорСчетБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>САкцептом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляБезакцептногоСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДляАкцепта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсылкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ПлатежноеТребование/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПлатежноеТребование";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ПлатежноеТребование";
	КомандаПечати.Представление		= НСтр("ru = 'Платежное требование'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПлатежноеТребование") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ПлатежноеТребование",
			"Платежное требование",
			Печать0401061(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры


// Функция формирует табличный документ инкассовое поручение (ф 0401071)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция Печать0401061(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент 					= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеТребование_ПлатежноеТребование";
	Макет 							= УправлениеПечатью.МакетПечатнойФормы("Документ.ПлатежноеТребование.ПФ_MXL_ПлатежноеТребование");
	Обл   							= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	Для НомерДокумента = 0 по МассивОбъектов.Количество()-1 цикл
	
		Обл.Параметры.Заполнить(ЗначенияРеквизитовПлатежноеТребование(МассивОбъектов[НомерДокумента]));
		
		ТабДокумент.Вывести(Обл);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			                                               НомерДокумента+1, ОбъектыПечати, МассивОбъектов[НомерДокумента]);
	КонецЦикла;	
	
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ЗначенияРеквизитовПлатежноеТребование(Ссылка)
	
	СтруктураДанных = Новый Структура;

	// Значения реквизитов Платежного поручения 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	|	Поручение.Номер 																		КАК НомерДок,
	|	Поручение.Дата 																			КАК ДатаДок,
	|	Поручение.ВидПлатежа 																	КАК ВидПлатежа,
	|	//Поручение.СтатусСоставителя 															КАК СтатусСоставителя,
	|	Поручение.ИННПолучателя																КАК ИноеИННПолучателя,
	|	Поручение.КПППолучателя																КАК ИноеКПППолучателя,
	|	""ИНН "" + Поручение.ИННПолучателя													КАК ИННПолучателя,
	|	""КПП "" + Поручение.КПППолучателя													КАК КПППолучателя,
	|	Поручение.СуммаДокумента 																КАК СуммаДокумента,
	|	Поручение.ПолучательНаименование 														КАК ТекстПолучателя,
	|	Поручение.ПолучательБанковскийСчет 													КАК НомерСчетаПолучателя,
	|	Поручение.ПолучательНаименованиеБанка 													КАК НаименованиеБанкаПолучателя,
	|	Поручение.ПолучательБИКБанка 															КАК БИКБанкаПолучателя,
	|	Поручение.ПолучательКорСчетБанка 														КАК СчетБанкаПолучателя,
	|	Поручение.КонтрагентНаименованиеБанка 													КАК НаименованиеБанкаПлательщика,
	|	Поручение.КонтрагентБИКБанка 															КАК БИКБанкаПлательщика,
	|	Поручение.КонтрагентКорСчетБанка 														КАК СчетБанкаПлательщика,
	|	Поручение.КонтрагентИНН																КАК КонтрагентИНН,
	|	Поручение.КонтрагентКПП																КАК КонтрагентКПП,
	|	""ИНН "" + Поручение.КонтрагентИНН														КАК ИННПлательщика,
	|	""КПП "" + Поручение.КонтрагентКПП														КАК КПППлательщика,
	|	Поручение.КонтрагентНаименование 														КАК ТекстПлательщика,
	|	Поручение.КонтрагентБанковскийСчет 													КАК НомерСчетаПлательщика,
	|	Поручение.СрокПлатежа																	КАК СрокПлатежа,
	|	Поручение.ОчередностьПлатежа 															КАК Очередность,
	|	Поручение.НазначениеПлатежа 															КАК НазначениеПлатежа,
	|//////// Служебные реквизиты
	|	ЕСТЬNULL(Поручение.РеквизитыЛицевогоСчета.МесяцПрописью, ЛОЖЬ) 	КАК МесяцПрописью,
	|	ЕСТЬNULL(Поручение.РеквизитыЛицевогоСчета.СуммаБезКопеек, ЛОЖЬ) 	КАК СуммаБезКопеек,
	|	Поручение.ЛицевойСчет 												КАК ЛицевойСчет,
	|	Поручение.РеквизитыЛицевогоСчета 									КАК РеквизитыЛицевогоСчета,
	|	Поручение.Организация 												КАК Организация,
	|	Поручение.СчетКонтрагента 											КАК СчетКонтрагента,
	|	Поручение.ДатаОтсылкиДокументов,
	|	Поручение.САкцептом,
	|	Поручение.СрокДляАкцепта,
	|	ВЫБОР
	|		КОГДА Поручение.САкцептом
	|			ТОГДА ВЫБОР Поручение.ВидАкцепта
	|					КОГДА 1
	|						ТОГДА ""1""
	|					КОГДА 2
	|						ТОГДА ""2""
	|					ИНАЧЕ ""С акцептом""
	|				КОНЕЦ
	|		ИНАЧЕ ""Без акцепта "" + ПОДСТРОКА(Поручение.ОснованиеДляБезакцептногоСписания, 1, 200)
	|	КОНЕЦ КАК УсловиеОплаты
	|ИЗ
	|	Документ.ПлатежноеТребование КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка
	|";

	МассивРезультатов = Запрос.Выполнить();
	
	Выборка = МассивРезультатов.Выбрать();			   
	Выборка.Следующий();
	
	Для Каждого Колонка ИЗ МассивРезультатов.Колонки Цикл
		СтруктураДанных.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);	
	КонецЦикла;

	// требует преобразования
	//СтруктураДанных.Вставить("НомерДок", ОбщегоНазначенияБГУ.ПолучитьНомерНаПечать(Новый Структура("Номер, Учреждение", СтруктураДанных.НомерДок, СтруктураДанных.Учреждение)));
	СтруктураДанных.Вставить("ДатаДокумента", 	Формат(СтруктураДанных.ДатаДок, "ДФ=" + ?(СтруктураДанных.МесяцПрописью, "'дд ММММ гггг'", "'дд.ММ.гггг'")));
	СтруктураДанных.Вставить("СуммаЧислом",		ПлатежноРасчетныеДокументы.ФорматироватьСуммуПлатежногоДокумента(СтруктураДанных.СуммаДокумента, СтруктураДанных.СуммаБезКопеек));
	СтруктураДанных.Вставить("СуммаПрописью",	ПлатежноРасчетныеДокументы.ФорматироватьСуммуПрописьюПлатежногоДокумента(СтруктураДанных.СуммаДокумента, , СтруктураДанных.СуммаБезКопеек));
	СтруктураДанных.Вставить("НаименованиеНомер","ПЛАТЕЖНОЕ ТРЕБОВАНИЕ № " + ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Ссылка,СтруктураДанных.НомерДок)); 
    	
	
	Возврат СтруктураДанных;
		
КонецФункции	

#КонецОбласти

#КонецЕсли
